Учет_проектов/src/Documents/Проект/Проект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Проект</name>
  <registerRecords>AccumulationRegister.РаботыПоПроектам</registerRecords>
  <attributes>
    <name>ПлощадьВнутриТепловогоКонтура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьТеррасИКрылец</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРаботЗаМетр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПроекта</name>
    <type>
      <types>EnumRef.СтатусыПроектов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботыПоПроекту</name>
    <attributes>
      <name>НаименованиеРабот</name>
      <type>
        <types>CatalogRef.НаборыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДатаВыполнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦиклРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапРабот</name>
      <type>
        <types>CatalogRef.ЭтапыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СметнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Контрагент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_проектов/src/AccumulationRegisters/РаботыПоПроектам/РаботыПоПроектам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РаботыПоПроектам</name>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Контрагент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>DocumentRef.Проект</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаименованиеРабот</name>
    <type>
      <types>CatalogRef.НаборыРабот</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Учет_проектов/src/Enums/СтатусыПроектов/СтатусыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроектов</name>
  <enumValues>
    <name>Предпроект</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

Учет_проектов/src/Documents/Проект/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ЭтоНовый() Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если СтатусПроекта = Перечисления.СтатусыПроектов.ВРаботе Тогда
		Движения.РаботыПоПроектам.Записывать = Истина;
		Для Каждого ТекСтрокаРаботыПоПроекту Из РаботыПоПроекту Цикл
			Движение = Движения.РаботыПоПроектам.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Исполнитель = ТекСтрокаРаботыПоПроекту.Исполнитель;
			Движение.Проект = Ссылка;
			Движение.НаименованиеРабот = ТекСтрокаРаботыПоПроекту.НаименованиеРабот;
			Движение.Объем = ТекСтрокаРаботыПоПроекту.Объем;
			Движение.Сумма = ТекСтрокаРаботыПоПроекту.СметнаяСтоимость;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
